# NumSObj

## Description
Function NumSObj returns the number of selected objects on the referenced layer.&lt;BR&gt;
&lt;BR&gt;

```pascal
FUNCTION NumSObj(h : HANDLE) : LONGINT;
```

```python

def vs.NumSObj(h):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to layer.|

## Version
Availability: from MiniCAD
## Category
* Selection